# UnsatisfiedWallAssocProp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..UnsatisfiedWallAssocProp Property
BuiltInFailures..::..SketchFailures Class See Also
---
Constraint between a Line created with Pick Wall and the Wall is not satisfied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnsatisfiedWallAssocProp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnsatisfiedWallAssocProp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnsatisfiedWallAssocProp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace